Revit 2027 API
RailingType.SecondaryHandRailPosition Property
 The position of the secondary handrail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public HandRailPosition SecondaryHandRailPosition { get; set; }
Public Property SecondaryHandRailPosition As HandRailPosition
	Get
	Set
public:
property HandRailPosition SecondaryHandRailPosition {
	HandRailPosition get ();
	void set (HandRailPosition value);
}
member SecondaryHandRailPosition : HandRailPosition with get, set
Property Value
HandRailPosition
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  When setting this property: The rail has no secondary hand rail.
See Also
Reference
RailingType Class
Autodesk.Revit.DB.Architecture Namespace